Revit 2026 API

# ElementTransformUtilsRotateElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RotateElements(
	Document document,
	ICollection<ElementId> elementsToRotate,
	Line axis,
	double angle
)
```
```vb
Public Shared Sub RotateElements (
	document As Document,
	elementsToRotate As ICollection(Of ElementId),
	axis As Line,
	angle As Double
)
```
```cpp
public:
static void RotateElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToRotate,
	Line^ axis,
	double angle
)
```
```fsharp
static member RotateElements :
        document : Document *
        elementsToRotate : ICollection<ElementId> *
        axis : Line *
        angle : float -> unit
```

#### Parameters

document Document

elementsToRotate ICollectionElementId

axis Line

angle Double

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace